Tekla Open API Reference for Tekla Structures 2025
ComponentInput.AddInputPolygon Method
 Adds a polygon to the component input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddInputPolygon(
	Polygon P
)
Public Function AddInputPolygon (
	P As Polygon
) As Boolean
Parameters
P
Type: Tekla.Structures.Model.Polygon
The polygon to be added.
Return Value
Type: Boolean
True on success.
See Also
Reference
ComponentInput Class
Tekla.Structures.Model Namespace